{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.1.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "learn2sofi", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 491520], "dtype": "float32", "sparse": false, "ragged": false, "name": "x_input"}, "name": "x_input", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_1d_2d", "trainable": true, "dtype": "float32", "target_shape": [30, 128, 128, 1]}, "name": "reshape_1d_2d", "inbound_nodes": [[["x_input", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "convlstm2d_1", "inbound_nodes": [[["reshape_1d_2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batchnorm_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batchnorm_1", "inbound_nodes": [[["convlstm2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1", "inbound_nodes": [[["batchnorm_1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "upsampling_1", "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2d_1d", "trainable": true, "dtype": "float32", "target_shape": [65536]}, "name": "reshape_2d_1d", "inbound_nodes": [[["upsampling_1", 0, 0, {}]]]}], "input_layers": [["x_input", 0, 0]], "output_layers": [["reshape_2d_1d", 0, 0]]}}, "training_config": {"loss": "mean_absolute_error", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batchnorm_1/gamma", "shape": [4], "dtype": "float32"}, {"name": "batchnorm_1/beta", "shape": [4], "dtype": "float32"}, {"name": "batchnorm_1/moving_mean", "shape": [4], "dtype": "float32"}, {"name": "batchnorm_1/moving_variance", "shape": [4], "dtype": "float32"}, {"name": "conv_1/kernel", "shape": [3, 3, 4, 1], "dtype": "float32"}, {"name": "conv_1/bias", "shape": [1], "dtype": "float32"}, {"name": "convlstm2d_1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "convlstm2d_1/recurrent_kernel", "shape": [3, 3, 4, 16], "dtype": "float32"}, {"name": "convlstm2d_1/bias", "shape": [16], "dtype": "float32"}]}]}