{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "learn2sofi", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 327680], "dtype": "float32", "sparse": false, "ragged": false, "name": "x_input"}, "name": "x_input", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_1d_2d", "trainable": true, "dtype": "float32", "target_shape": [20, 128, 128, 1]}, "name": "reshape_1d_2d", "inbound_nodes": [[["x_input", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Min_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Min_5", "op": "Min", "input": ["reshape_1d_2d_5/Identity", "Min_5/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 2, 3, 4]}}, "name": "tf_op_layer_Min_5", "inbound_nodes": [[["reshape_1d_2d", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_10", "op": "Reshape", "input": ["Min_5", "Reshape_10/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_Reshape_10", "inbound_nodes": [[["tf_op_layer_Min_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_5", "op": "Sub", "input": ["reshape_1d_2d_5/Identity", "Reshape_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_5", "inbound_nodes": [[["reshape_1d_2d", 0, 0, {}], ["tf_op_layer_Reshape_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Max_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Max_5", "op": "Max", "input": ["Sub_5", "Max_5/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 2, 3]}}, "name": "tf_op_layer_Max_5", "inbound_nodes": [[["tf_op_layer_Sub_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_11", "op": "Reshape", "input": ["Max_5", "Reshape_11/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_Reshape_11", "inbound_nodes": [[["tf_op_layer_Max_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_5", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_5", "op": "RealDiv", "input": ["Sub_5", "Reshape_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_RealDiv_5", "inbound_nodes": [[["tf_op_layer_Sub_5", 0, 0, {}], ["tf_op_layer_Reshape_11", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "convlstm2d_1", "inbound_nodes": [[["tf_op_layer_RealDiv_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batchnorm_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batchnorm_1", "inbound_nodes": [[["convlstm2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["batchnorm_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "DepthToSpace_5", "trainable": true, "dtype": "float32", "node_def": {"name": "DepthToSpace_5", "op": "DepthToSpace", "input": ["conv2d_10/Identity"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "block_size": {"i": "2"}}}, "constants": {}}, "name": "tf_op_layer_DepthToSpace_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["tf_op_layer_DepthToSpace_5", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2d_1d", "trainable": true, "dtype": "float32", "target_shape": [65536]}, "name": "reshape_2d_1d", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}], "input_layers": [["x_input", 0, 0]], "output_layers": [["reshape_2d_1d", 0, 0]]}}, "training_config": {"loss": "mean_absolute_error", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batchnorm_1/gamma", "shape": [8], "dtype": "float32"}, {"name": "batchnorm_1/beta", "shape": [8], "dtype": "float32"}, {"name": "batchnorm_1/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batchnorm_1/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 8, 4], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [4], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [1], "dtype": "float32"}, {"name": "convlstm2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "convlstm2d_1/recurrent_kernel", "shape": [3, 3, 8, 32], "dtype": "float32"}, {"name": "convlstm2d_1/bias", "shape": [32], "dtype": "float32"}]}]}